rails4testing/app/controllers/flavors_controller.rb

SELECT "flavors".* FROM "flavors"
---
  def index
    @flavors = Flavor.all

SELECT  "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def update
    if params[:food_id]
      @food = Food.find(params[:food_id])

SELECT  "flavors".* FROM "flavors" WHERE "flavors"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def set_flavor
    @flavor = Flavor.find(params[:id])