rails4testing/app/controllers/foods_controller.rb

  def index
    @foods = Food.all
---
SELECT "foods".* FROM "foods"

  def create
    @food = Food.new(food_params)

    if @food.save
---
INSERT INTO "foods" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Pizza"], ["created_at", "2019-04-07 17:13:01.170322"], ["updated_at", "2019-04-07 17:13:01.170322"]]

  def update
    if @food.update(food_params)
---
UPDATE "foods" SET "name" = $1, "updated_at" = $2 WHERE "foods"."id" = $3  [["name", "Pizzas"], ["updated_at", "2019-04-07 17:13:08.435890"], ["id", 1]]

  def set_food
    @food = Food.find(params[:id])
---
SELECT  "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]